yxz29315/M55M1-Sample-Code/M55M1BSP-3.01.003/SampleCode/NuEdgeWise/FaceLandmark/main.cpp
static void DrawFaceLandmark(
    const std::vector<arm::app::face_landmark::KeypointResult> &results,
	int posOffsetX,
	int posOffsetY,		
    image_t *drawImg
)
{
	int i;
	arm::app::face_landmark::KeypointResult keyPoint;
	int keypointSize = results.size();
	
	for(i = 0; i < keypointSize; i ++)
	{
		keyPoint = results[i];
		//draw points
		if(i < 468)
		{
			imlib_draw_circle(drawImg, posOffsetX + keyPoint.m_x, posOffsetY + keyPoint.m_y, 1, COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0), 1, true);	
		}
		else
		{	
			imlib_draw_circle(drawImg, posOffsetX + keyPoint.m_x, posOffsetY + keyPoint.m_y, 1, COLOR_R5_G6_B5_TO_RGB565(0, 0, COLOR_B5_MAX), 1, true);	
		}
	}
}

/* Draw lip keypoints prominently (green circles) */
static void DrawLipLandmark(
    const std::vector<arm::app::face_landmark::KeypointResult> &results,
	int posOffsetX,
	int posOffsetY,
    image_t *drawImg
)
{
	if (results.size() < 468) return;
	for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
		int idx = s_i32LipLandmarkIndices[i];
		if (idx < (int)results.size()) {
			const auto &kp = results[idx];
			imlib_draw_circle(drawImg, posOffsetX + kp.m_x, posOffsetY + kp.m_y, 3, COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0), 2, true);
		}
	}
}

/* Compute lip keypoint velocity (avg movement) and update speaking state */
static float ComputeLipVelocity(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    int faceIdx,
    int posOffsetX,
    int posOffsetY
)
{
    float velocity = 0.0f;
    int validPoints = 0;

    if (results_KP.size() < 468 || faceIdx >= MAX_TRACKED_FACES || !s_asPrevLipState[faceIdx].valid)
        return 0.0f;

    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        int idx = s_i32LipLandmarkIndices[i];
        if (idx >= (int)results_KP.size()) continue;

        float curX = posOffsetX + results_KP[idx].m_x;
        float curY = posOffsetY + results_KP[idx].m_y;
        float dx = curX - s_asPrevLipState[faceIdx].lipX[i];
        float dy = curY - s_asPrevLipState[faceIdx].lipY[i];
        velocity += (float)std::sqrt(dx*dx + dy*dy);
        validPoints++;
    }
    return (validPoints > 0) ? (velocity / validPoints) : 0.0f;
}

/* Store current lip positions for next frame's velocity computation */
static void StoreLipPositions(
    const std::vector<arm::app::face_landmark::KeypointResult> &results_KP,
    int faceIdx,
    int posOffsetX,
    int posOffsetY
)
{
    if (faceIdx >= MAX_TRACKED_FACES || results_KP.size() < 468) return;

    for (int i = 0; i < LIP_LANDMARK_NUM; i++) {
        int idx = s_i32LipLandmarkIndices[i];
        if (idx < (int)results_KP.size()) {
            s_asPrevLipState[faceIdx].lipX[i] = posOffsetX + results_KP[idx].m_x;
            s_asPrevLipState[faceIdx].lipY[i] = posOffsetY + results_KP[idx].m_y;
        }
    }
    s_asPrevLipState[faceIdx].valid = 1;
}

static void DrawDetectFace(
    std::vector<arm::app::face_detection::DetectionResult> &results,
    std::vector<bool> &isSpeaking,
    image_t *drawImg
)
{
	arm::app::face_detection::DetectionResult faceBox;
	int faceBoxSize = results.size();
	
	for(int i = 0; i < faceBoxSize; i ++)
	{
		faceBox = results[i];
		/* Green when speaking, blue otherwise */
		int boxColor = (i < (int)isSpeaking.size() && isSpeaking[i])
			? COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0)  /* Green */
			: COLOR_B5_MAX;  /* Blue */
		imlib_draw_rectangle(drawImg, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h, boxColor, 2, false);
		/* Draw "Speaking" label when speaking */
		if (i < (int)isSpeaking.size() && isSpeaking[i]) {
			imlib_draw_string(drawImg, faceBox.m_x0, faceBox.m_y0 - 14, "Speaking", COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0), 1, 0, 0, false, 0, false, false, 0, false, false);
		}
	}
}

static void DetectFaceRegion(
    S_FRAMEBUF *infFramebuf,
    arm::app::FaceDetectionModel *faceDetectionModel,	
	arm::app::FaceDetectorPostProcess *postProcess,
	arm::app::Profiler *profiler
)
{
    TfLiteIntArray *inputShape = faceDetectionModel->GetInputShape(0);
    TfLiteTensor *inputTensor   = faceDetectionModel->GetInputTensor(0);
    rectangle_t roi;

    const int inputImgCols = inputShape->data[arm::app::FaceDetectionModel::ms_inputColsIdx];
    const int inputImgRows = inputShape->data[arm::app::FaceDetectionModel::ms_inputRowsIdx];

	uint64_t u64StartCycle;
	uint64_t u64EndCycle;

	auto *req_data = static_cast<uint8_t *>(inputTensor->data.data);
	auto *signed_req_data = static_cast<int8_t *>(inputTensor->data.data);

    arm::app::QuantParams inQuantParams = arm::app::GetTensorQuantParams(inputTensor);
	
	//resize full image to input tensor
	image_t resizeImg;

	roi.x = 0;
	roi.y = 0;
	roi.w = infFramebuf->frameImage.w;
	roi.h = infFramebuf->frameImage.h;

	resizeImg.w = inputImgCols;
	resizeImg.h = inputImgRows;
	resizeImg.data = (uint8_t *)inputTensor->data.data; //direct resize to input tensor buffer
	resizeImg.pixfmt = PIXFORMAT_GRAYSCALE;

	if(profiler)
		u64StartCycle = pmu_get_systick_Count();

	imlib_nvt_scale(&infFramebuf->frameImage, &resizeImg, &roi);

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("face detect resize cycles %llu \n", (u64EndCycle - u64StartCycle));
	}

	if(profiler){
		u64StartCycle = pmu_get_systick_Count();
	}
		
    /* face landmark/detection model preprocessing is image conversion from uint8 to [0,1] float values,
     * then quantize them with input quantization info. */
	for (size_t i = 0; i < inputTensor->bytes; i++)
	{
//		auto i_data_int8 = static_cast<int8_t>(((static_cast<float>(req_data[i]) / 255.0f) / inQuantParams.scale) + inQuantParams.offset);
//		signed_req_data[i] = std::min<int8_t>(INT8_MAX, std::max<int8_t>(i_data_int8, INT8_MIN));
		signed_req_data[i] = static_cast<int8_t>(req_data[i]) - 128;
	}

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("face detect quantize cycles %llu \n", (u64EndCycle - u64StartCycle));
	}

	if(profiler){
		profiler->StartProfiling("Inference");
	}

	faceDetectionModel->RunInference();

	if(profiler){
		profiler->StopProfiling();
		profiler->PrintProfilingResult();
	}

	if(profiler){
		u64StartCycle = pmu_get_systick_Count();
	}
	
	postProcess->RunPostProcess(infFramebuf->results_FD);

	if(profiler){
		u64EndCycle = pmu_get_systick_Count();
		info("face detect post processing cycles %llu \n", (u64EndCycle - u64StartCycle));
	}

